{
  "_name_or_path": "models\\water\\checkpoints\\SAM-water-hf\\checkpoint_1200",
  "architectures": [
    "SamModel"
  ],
  "initializer_range": 0.02,
  "mask_decoder_config": {
    "model_type": ""
  },
  "model_type": "sam",
  "prompt_encoder_config": {
    "model_type": ""
  },
  "torch_dtype": "float32",
  "transformers_version": "4.47.1",
  "vision_config": {
    "dropout": 0.0,
    "initializer_factor": 1.0,
    "intermediate_size": 6144,
    "model_type": "",
    "num_channels": 15,
    "projection_dim": 512
  }
}
